In [1]:
import pandas as pd
# import mysql.connector
import sqlalchemy as alc

In [2]:
# dbku = mysql.connector.connect(
# host = "localhost",
# user = "root",
# passwd = "363636",
# database = "panda_tes"
# )

In [3]:
query = 'select * from employees'
# df = pd.read_sql(query, dbku)
alamatDB = "mysql://root:363636@localhost:3306/panda_tes"
df = pd.read_sql(query, alamatDB)
df

   id     nama                 email               waktu
0   1   Asnawi       asnawi@yahoo.id 2019-12-09 09:36:42
1   2    Bagas  bagasadi@yahoo.co.id 2019-12-09 09:36:42
2   3     Evan      evan@yahoo.co.id 2019-12-09 09:36:42
3   4  Osvaldo   osvaldo@yahoo.co.id 2019-12-09 09:36:42

In [4]:
query = 'select * from employees'
con = alc.create_engine('mysql://root:363636@localhost/panda_tes')

In [5]:
df = pd.read_sql(query, con)
df

   id     nama                 email               waktu
0   1   Asnawi       asnawi@yahoo.id 2019-12-09 09:36:42
1   2    Bagas  bagasadi@yahoo.co.id 2019-12-09 09:36:42
2   3     Evan      evan@yahoo.co.id 2019-12-09 09:36:42
3   4  Osvaldo   osvaldo@yahoo.co.id 2019-12-09 09:36:42

In [6]:
df = pd.read_sql('employees', con, columns=['nama'])
df2=pd.read_sql('select nama, waktu from employees', con)
df.nama
df2

      nama               waktu
0   Asnawi 2019-12-09 09:36:42
1    Bagas 2019-12-09 09:36:42
2     Evan 2019-12-09 09:36:42
3  Osvaldo 2019-12-09 09:36:42

In [7]:
newData =pd.DataFrame([
    {'id':5,'nama':'Saddil','email':'saddil@gmail.com'}])

In [8]:
df2

      nama               waktu
0   Asnawi 2019-12-09 09:36:42
1    Bagas 2019-12-09 09:36:42
2     Evan 2019-12-09 09:36:42
3  Osvaldo 2019-12-09 09:36:42